davelee98/Firmware_Unified/targets/esp32-idf/src/device_control.cpp
#include "device_control.h"
#include "structs.h"
#include "touch_input.h"
#include "power_latch.h"
#include "buzzer_control.h"
#include "od_log.h"
#include <string.h>

#ifdef TARGET_ESP32
void enterDeepSleep(bool force = false, uint16_t overrideSleepSeconds = 0);
#endif

#ifdef TARGET_NRF
#include <Arduino.h>     // pinMode/attachInterrupt for the nRF arm; leaves at migration step 4
#include <bluefruit.h>   // enterDFUMode() drives the SoftDevice teardown directly
extern "C" {
#include "nrf_soc.h"
}
extern "C" void bootloader_util_app_start(uint32_t start_addr);
#endif
#ifdef TARGET_ESP32
#include <esp_system.h>
#include "driver/gpio.h"
#include "od_hal_adc.h"
#include "od_hal_gpio.h"
#include "od_hal_time.h"
#include "wifi_service.h"      // OPENDISPLAY_HAS_WIFI + opendisplay_lan_teardown()
#endif

#include "ble_transport.h"

extern uint8_t rebootFlag;
extern struct od_config globalConfig;
extern uint8_t activeLedInstance;
extern bool ledFlashActive;
extern uint8_t ledFlashPosition;
extern uint8_t dynamicreturndata[11];
extern uint8_t buttonStateCount;
extern volatile bool buttonEventPending;
extern volatile uint8_t lastChangedButtonIndex;
void updatemsdata();
void cleanupDirectWriteState(bool refreshDisplay);
void cleanupPartialWriteOnDisconnect(void);
void resetPipeWriteState(void);
#include "od_cmd_reply.h"

extern ButtonState buttonStates[MAX_BUTTONS];

// No target guard: every line below is portable Arduino GPIO, and the two
// powerLatch*Configured() predicates return false unless the board actually declares
// a latch (DEVICE_FLAG_BATTERY_LATCH / DEVICE_FLAG_PWR_LATCH_DFF plus the pins). The
// old #ifdef TARGET_ESP32 was inherited from power_latch.cpp being ESP32-gated as a
// whole; that gate is gone, because the latch is a board feature, not a SoC feature.
static bool s_pwrOffReleased[MAX_BUTTONS];
static bool s_pwrOffPressing[MAX_BUTTONS];
static bool s_pwrOffDone[MAX_BUTTONS];
static uint32_t s_pwrOffStartMs[MAX_BUTTONS];

static void pollConfiguredPowerOffButtons() {
    if (!powerLatchDffConfigured() && !powerLatchMosfetConfigured()) {
        return;
    }
    for (uint8_t i = 0; i < buttonStateCount; i++) {
        ButtonState* btn = &buttonStates[i];
        if (!btn->initialized || !btn->power_off) {
            continue;
        }
        bool pinState = (od_hal_gpio_read(btn->pin) != 0);
        bool down = btn->inverted ? !pinState : pinState;
        if (!down) {
            s_pwrOffReleased[i] = true;
            s_pwrOffPressing[i] = false;
            s_pwrOffDone[i] = false;
            continue;
        }
        if (!s_pwrOffReleased[i]) {
            continue;
        }
        if (!s_pwrOffPressing[i]) {
            s_pwrOffPressing[i] = true;
            s_pwrOffStartMs[i] = od_hal_uptime_ms();
            continue;
        }
        if (!s_pwrOffDone[i] && od_hal_uptime_ms() - s_pwrOffStartMs[i] >= btn->power_off_hold_ms) {
            s_pwrOffDone[i] = true;
            passiveBuzzerPowerOffAlert();
            powerLatchTriggerOff();
        }
    }
}

// BinaryInputs.input_type wire values (see structs.h for the full contract).
// 2 is reserved for switches (host-side feature); the ADC ladder uses 3.
#define BINARY_INPUT_TYPE_ADC_LADDER 3

// --- ADC resistor-ladder buttons (e.g. XTEINK X4) -------------------------
// Several buttons share one ADC pin via a resistor ladder, distinguished by
// voltage. They have no edge interrupt, so they are polled. Reported through
// the same MSD button byte as digital buttons for a uniform host contract.
//
// No target guard. Everything here is analogRead/pinMode/millis; the single
// SoC-specific call (input range) is shimmed in adcLadderConfigurePin() below.
// Gating the whole block on TARGET_ESP32 did not merely disable the feature on nRF,
// it MIS-handled it: the `continue` that skips ladder inputs in initButtons() was
// inside the same guard, so a BINARY_INPUT_TYPE_ADC_LADDER entry fell through to the
// digital-button path and had a CHANGE interrupt attached to the ladder pin.
#define MAX_ADC_LADDERS     4
#define MAX_LADDER_BUTTONS  4    // reserved[] holds at most N+1 = 5 LE uint16 thresholds
#define ADC_LADDER_POLL_MS  5
#define ADC_LADDER_DEBOUNCE 3    // consecutive equal samples required to accept a change

// Thresholds for N+1 buttons must fit in BinaryInputs.reserved[]; fail the build if not.
static_assert(2 + 2 * (MAX_LADDER_BUTTONS + 1) <= sizeof(BinaryInputs::reserved),
              "ADC ladder thresholds would overflow BinaryInputs.reserved[]");

struct AdcLadder {
    uint8_t  pin;
    uint8_t  num_buttons;
    uint8_t  id_base;
    uint8_t  byte_index;
    uint16_t thresholds[MAX_LADDER_BUTTONS + 1];  // descending; [0] = idle ceiling
    int8_t   current_button;     // -1 = none pressed
    int8_t   candidate_button;   // debounce: last raw classification
    uint8_t  candidate_count;    // consecutive samples equal to candidate
    uint8_t  press_count;        // 0-15, increments per press (5 s reset window)
    uint8_t  last_button_id;     // id of most recent press (for clean release reporting)
    uint32_t last_press_time;
};
static AdcLadder adcLadders[MAX_ADC_LADDERS];
static uint8_t   adcLadderCount = 0;

// The one SoC-specific step: put the pad in its widest input range and fix the
// reading scale, so a single set of config thresholds means the same thing on both.
//
// ESP32: 11 dB attenuation widens the usable span to roughly 0..2.5 V; analogRead is
// already 12-bit there by default.
// nRF52840: the SAADC needs no per-pad attenuation call, but the Adafruit core
// defaults analogRead to 10-bit, which would silently quarter every reading against
// thresholds written for a 12-bit part. Match the scale explicitly.
//
// UNVALIDATED ON nRF HARDWARE -- no nRF board with a ladder exists yet. The reference
// voltages still differ, so thresholds remain a per-board calibration carried in
// BinaryInputs.reserved[]; this only makes the SCALE comparable.
static void adcLadderConfigurePin(uint8_t pin) {
#if defined(TARGET_ESP32)
    // 12 dB, which is what Arduino's ADC_11db mapped to: IDF 5.x deprecated ADC_ATTEN_DB_11 in
    // favour of DB_12 -- the same setting under a name that matches the silicon.
    od_hal_adc_set_atten(pin, OD_ADC_ATTEN_12DB);
#else
    (void)pin;
    analogReadResolution(12);
#endif
}

