davelee98/Firmware_Unified/targets/esp32-idf/src/device_control.cpp
// Returns button index 0..num_buttons-1, or -1 when nothing is pressed.
static int classifyAdcLadder(int adc, const AdcLadder* l) {
    if (adc > (int)l->thresholds[0]) return -1;            // above idle ceiling
    for (uint8_t i = 0; i < l->num_buttons; i++) {
        if (adc > (int)l->thresholds[i + 1]) return (int)i; // thr[i+1] < adc <= thr[i]
    }
    return (int)l->num_buttons - 1;                        // catch-all bottom bucket
}

static void registerAdcLadder(const struct BinaryInputs* input) {
    if (adcLadderCount >= MAX_ADC_LADDERS) return;
    uint8_t n = input->reserved[0];                        // num_buttons
    if (n == 0 || n > MAX_LADDER_BUTTONS) {
        od_log_warn("ADC ladder: count %u out of range 1..%u on pin %u, skipping",
                    n, MAX_LADDER_BUTTONS, input->input_pin_1);
        return;
    }
    if (input->button_data_byte_index > 10) {              // index into the 11-byte MSD block
        od_log_warn("ADC ladder: byte_index %u out of range 0..10 on pin %u, skipping",
                    input->button_data_byte_index, input->input_pin_1);
        return;
    }
    if ((int)input->reserved[1] + n > 8) {                 // 3-bit id field: id_base..id_base+n-1 must be <= 7
        od_log_warn("ADC ladder: id_base %u + count %u exceeds 3-bit id space on pin %u, skipping",
                    input->reserved[1], n, input->input_pin_1);
        return;
    }
    AdcLadder* l = &adcLadders[adcLadderCount];
    l->pin = input->input_pin_1;                            // ADC GPIO
    l->num_buttons = n;
    l->id_base = input->reserved[1];
    l->byte_index = input->button_data_byte_index;
    for (uint8_t k = 0; k <= n; k++) {
        l->thresholds[k] = (uint16_t)input->reserved[2 + 2 * k] |
                           ((uint16_t)input->reserved[3 + 2 * k] << 8);
    }
    for (uint8_t k = 0; k < n; k++) {                      // contract: thresholds strictly descending
        if (l->thresholds[k] <= l->thresholds[k + 1]) {    // reject malformed config from any host
            od_log_warn("ADC ladder: thresholds not strictly descending on pin %u, skipping", input->input_pin_1);
            return;
        }
    }
    l->current_button = -1;
    l->candidate_button = -1;
    l->candidate_count = 0;
    l->press_count = 0;
    l->last_button_id = (uint8_t)(l->id_base & 0x07);
    l->last_press_time = 0;
    od_hal_gpio_config_input(l->pin, /*pull_up=*/false, /*pull_down=*/false);
    // A throwaway read, kept: it forces the channel to be configured before the attenuation is
    // applied below, which is the order this was found working in.
    (void)od_hal_adc_read(l->pin);
    adcLadderConfigurePin(l->pin);
    if (!od_hal_adc_pin_readable(l->pin)) {
        // One line at registration. Every later read returns 0, and the classifier puts 0 in
        // its catch-all bottom bucket -- so the failure presents as the last button
        // permanently pressed, not as nothing happening. See od_hal_adc.h.
        od_log_warn("ADC ladder: pin %u is not an ADC1 input -- readings will be 0", l->pin);
    }
    adcLadderCount++;
    od_log_info("ADC ladder: pin %u n %u idBase %u byteIdx %u", l->pin, n, l->id_base, l->byte_index);
}

static void pollAdcButtons() {
    if (adcLadderCount == 0) return;
    static uint32_t lastPoll = 0;
    uint32_t now = od_hal_uptime_ms();
    if (now - lastPoll < ADC_LADDER_POLL_MS) return;
    lastPoll = now;
    for (uint8_t i = 0; i < adcLadderCount; i++) {
        AdcLadder* l = &adcLadders[i];
        int adc = od_hal_adc_read(l->pin);
        int btn = classifyAdcLadder(adc, l);
        if (btn == l->candidate_button) {
            if (l->candidate_count < 255) l->candidate_count++;
        } else {
            l->candidate_button = (int8_t)btn;
            l->candidate_count = 1;
        }
        if (l->candidate_count < ADC_LADDER_DEBOUNCE) continue;  // not yet stable
        if (btn == l->current_button) continue;                 // no change
        uint8_t state;
        if (btn >= 0) {
            if (l->last_press_time == 0 || now - l->last_press_time > 5000) l->press_count = 0;
            l->press_count = (uint8_t)((l->press_count + 1) & 0x0F);
            l->last_press_time = now;
            l->last_button_id = (uint8_t)((l->id_base + btn) & 0x07);
            state = 1;
        } else {
            state = 0;  // released; last_button_id identifies which button
        }
        l->current_button = (int8_t)btn;
        uint8_t data = (uint8_t)((l->last_button_id & 0x07) |
                                 ((l->press_count & 0x0F) << 3) |
                                 ((state & 0x01) << 7));
        if (l->byte_index < 11) dynamicreturndata[l->byte_index] = data;
        updatemsdata();
        od_log_debug("ADC btn pin %u adc=%d idx=%d id=%u cnt=%u state=%u",
                    l->pin, adc, btn, l->last_button_id, l->press_count, state);
    }
}

// The BLE connect/disconnect application hooks that used to live here are gone
// as of Phase 3. Both targets now service connect and disconnect from loop():
// serviceBleEvents() does the connect-side work (rebootFlag, MSD refresh, link
// tuning) and calls requestTransferSessionCleanup(), and
// serviceBleDisconnectCleanup() owns the session teardown -- which is where the
// mid-refresh and LAN-ownership guards live. nRF used to run that teardown
// inline on the SoftDevice callback task with neither guard.

#ifdef TARGET_ESP32
// Tear NimBLE down before esp_restart(): esp_restart() resets the CPU but NOT the
// BT controller hardware, so on the next (software-reset) boot BLEDevice::init()
// tries to enable an already-enabled controller and aborts -> PANIC boot loop that
// only a physical power cycle clears. Mirrors the deep-sleep teardown in
// enterDeepSleep() (main.cpp), which is why sleep->wake re-inits cleanly.
static void esp32_ble_deinit_before_restart() {
#ifdef OPENDISPLAY_HAS_WIFI
    // F5 (extends PR #114): esp_restart() resets the CPU but not the WiFi radio or
    // open sockets/TLS context. Tear the LAN listener + mbedTLS state down first so
    // the next boot re-inits WiFi cleanly (mirrors the BLE deinit below).
    opendisplay_lan_teardown();
#endif
    ble.stopAdvertising();
    od_hal_delay_ms(200);
    // F7: THIS is the path where a failed teardown actually costs something. esp_restart()
    // resets the CPU but NOT the controller, so if the stack is still up here, the next boot
    // re-enters od_ble_init() against a live controller, nimble_port_init() fails, and BLE is
    // dead for that entire boot with only a log line to explain it. The restart proceeds --
    // refusing to reboot on this would be worse -- but the log now names the cause in advance
    // instead of leaving the next boot's failure unexplained.
    if (ble.end()) {              // clearAll: disables + releases the BT controller
        od_log_info("BLE deinitialized before restart");
    } else {
        od_log_error("ERROR: BLE teardown FAILED before restart -- the controller is still "
                     "enabled; expect nimble_port_init() to fail on the next boot");
    }
    od_hal_delay_ms(100);
}
#endif

void reboot(){
    // Banner logged by the dispatcher (commandName() in communication.cpp).
    od_hal_delay_ms(100);
#ifdef TARGET_NRF
    NVIC_SystemReset();
#endif
#ifdef TARGET_ESP32
    esp32_ble_deinit_before_restart();
    esp_restart();
#endif
}

#define LED_DELAY_FACTOR_MS 100u
#define LED_MIN_STEP_DELAY_MS 1u

