davelee98/Firmware_Unified/targets/esp32-idf/src/device_control.cpp
typedef enum {
    LED_PHASE_IDLE = 0,
    LED_PHASE_GROUP,
    LED_PHASE_LOOP1,
    LED_PHASE_LOOP1_DELAY,
    LED_PHASE_INTER1_DELAY,
    LED_PHASE_LOOP2,
    LED_PHASE_LOOP2_DELAY,
    LED_PHASE_INTER2_DELAY,
    LED_PHASE_LOOP3,
    LED_PHASE_LOOP3_DELAY,
    LED_PHASE_INTER3_DELAY,
} led_phase_t;

static struct {
    bool active;
    uint8_t instance;
    struct LedConfig* led;
    uint8_t brightness;
    uint8_t c1;
    uint8_t c2;
    uint8_t c3;
    uint8_t loop1delay;
    uint8_t loop2delay;
    uint8_t loop3delay;
    uint8_t loopcnt1;
    uint8_t loopcnt2;
    uint8_t loopcnt3;
    uint8_t ildelay1;
    uint8_t ildelay2;
    uint8_t ildelay3;
    uint8_t grouprepeats;
    uint8_t group_pos;
    uint8_t i1;
    uint8_t i2;
    uint8_t i3;
    led_phase_t phase;
    bool waiting_delay;
    uint32_t delay_until_ms;
} s_led;

static void led_all_off(struct LedConfig* led) {
    if (led == NULL) {
        return;
    }
    bool invertRed = (led->led_flags & 0x01) != 0;
    bool invertGreen = (led->led_flags & 0x02) != 0;
    bool invertBlue = (led->led_flags & 0x04) != 0;
    if (led->led_1_r != 0xFF) {
        od_hal_gpio_write(led->led_1_r, invertRed);
    }
    if (led->led_2_g != 0xFF) {
        od_hal_gpio_write(led->led_2_g, invertGreen);
    }
    if (led->led_3_b != 0xFF) {
        od_hal_gpio_write(led->led_3_b, invertBlue);
    }
}

static void led_stop_internal(bool clear_mode) {
    struct LedConfig* led = s_led.led;
    s_led.waiting_delay = false;
    if (led != NULL) {
        led_all_off(led);
        if (clear_mode) {
            led->reserved[0] = 0x00;
        }
    }
    memset(&s_led, 0, sizeof(s_led));
    ledFlashActive = false;
    activeLedInstance = 0xFF;
    ledFlashPosition = 0;
}

static void led_schedule_delay_ms(uint16_t ms) {
    if (ms == 0) {
        s_led.waiting_delay = false;
        return;
    }
    s_led.waiting_delay = true;
    s_led.delay_until_ms = od_hal_uptime_ms() + ms;
}

static void led_load_config(struct LedConfig* led) {
    // The 12-byte flash pattern persisted in LedConfig.reserved[] is struct
    // LedFlashPattern (all single bytes, no endianness). Overlay-read to name the
    // fields; the nibble packing (mode/brightness, delay/count) stays hand-decoded.
    const struct LedFlashPattern* p = (const struct LedFlashPattern*)led->reserved;
    s_led.led = led;
    s_led.brightness = (uint8_t)(((p->mode_brightness >> 4) & 0x0F) + 1);
    s_led.c1 = p->color1;
    s_led.c2 = p->color2;
    s_led.c3 = p->color3;
    s_led.loop1delay = (uint8_t)((p->loop1_delay_count >> 4) & 0x0F);
    s_led.loop2delay = (uint8_t)((p->loop2_delay_count >> 4) & 0x0F);
    s_led.loop3delay = (uint8_t)((p->loop3_delay_count >> 4) & 0x0F);
    s_led.loopcnt1 = (uint8_t)(p->loop1_delay_count & 0x0F);
    s_led.loopcnt2 = (uint8_t)(p->loop2_delay_count & 0x0F);
    s_led.loopcnt3 = (uint8_t)(p->loop3_delay_count & 0x0F);
    s_led.ildelay1 = p->inter_loop_delay1;
    s_led.ildelay2 = p->inter_loop_delay2;
    s_led.ildelay3 = p->inter_loop_delay3;
    s_led.grouprepeats = (uint8_t)(p->group_repeats + 1);
    s_led.group_pos = 0;
    s_led.i1 = 0;
    s_led.i2 = 0;
    s_led.i3 = 0;
    s_led.phase = LED_PHASE_GROUP;
    s_led.waiting_delay = false;
}

static void led_run_finish(void) {
    led_stop_internal(false);
}

static void led_run_step(void) {
    struct LedConfig* led;
    uint8_t mode;

    if (!s_led.active || s_led.led == NULL) {
        return;
    }
    led = s_led.led;
    activeLedInstance = s_led.instance;
    mode = (uint8_t)(led->reserved[0] & 0x0F);
    if (mode != 1) {
        led_run_finish();
        return;
    }

    for (;;) {
        if (!s_led.active) {
            return;
        }

        switch (s_led.phase) {
            case LED_PHASE_GROUP:
                if (s_led.group_pos >= s_led.grouprepeats && s_led.grouprepeats != 255) {
                    led->reserved[0] = 0x00;
                    led_run_finish();
                    return;
                }
                s_led.i1 = 0;
                s_led.i2 = 0;
                s_led.i3 = 0;
                s_led.phase = LED_PHASE_LOOP1;
                break;

            case LED_PHASE_LOOP1:
                if (s_led.i1 >= s_led.loopcnt1) {
                    if (s_led.ildelay1 > 0) {
                        s_led.phase = LED_PHASE_INTER1_DELAY;
                        led_schedule_delay_ms((uint16_t)(s_led.ildelay1 * LED_DELAY_FACTOR_MS));
                        return;
                    }
                    s_led.phase = LED_PHASE_LOOP2;
                    break;
                }
                flashLed(s_led.c1, s_led.brightness);
                s_led.i1++;
                if (s_led.loop1delay > 0) {
                    s_led.phase = LED_PHASE_LOOP1_DELAY;
                    led_schedule_delay_ms((uint16_t)(s_led.loop1delay * LED_DELAY_FACTOR_MS));
                } else {
                    led_schedule_delay_ms(LED_MIN_STEP_DELAY_MS);
                }
                return;

            case LED_PHASE_LOOP1_DELAY:
                s_led.phase = LED_PHASE_LOOP1;
                break;

            case LED_PHASE_INTER1_DELAY:
                s_led.phase = LED_PHASE_LOOP2;
                break;

            case LED_PHASE_LOOP2:
                if (s_led.i2 >= s_led.loopcnt2) {
                    if (s_led.ildelay2 > 0) {
                        s_led.phase = LED_PHASE_INTER2_DELAY;
                        led_schedule_delay_ms((uint16_t)(s_led.ildelay2 * LED_DELAY_FACTOR_MS));
                        return;
                    }
                    s_led.phase = LED_PHASE_LOOP3;
                    break;
                }
                flashLed(s_led.c2, s_led.brightness);
                s_led.i2++;
                if (s_led.loop2delay > 0) {
                    s_led.phase = LED_PHASE_LOOP2_DELAY;
                    led_schedule_delay_ms((uint16_t)(s_led.loop2delay * LED_DELAY_FACTOR_MS));
                } else {
                    led_schedule_delay_ms(LED_MIN_STEP_DELAY_MS);
                }
                return;

